Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.SeparationWithOddJunction
Hydraulic separation requires an even number of junctions on the header pipe for accurate calculations. Add or remove junctions to complete the separation.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.SeparationNotAtJunction
This hydraulic loop is not separated at any junction. Use the Remove Separation tool to clean up undesired hydraulic separations.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.PumpPressureNotComputed
The calculated pressure drop of this pump is not computed because the critical path is not a closed loop. Check to see if there are other pumps intended for use within a secondary/tertiary loop. Use the Add Separation tool to define the secondary/tertiary loop.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.PressureLossNotSetInLossFamily
A calculation did not complete because the pressure loss value for the source equipment is not set for the network.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.PlumbingFlowCalculatorNotAvailable
Plumbing Flow Calculator Not Available: [Calculator Name]

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.PipePressureDropCalculatorNotAvailable
Pipe Pressure Drop Calculator Not Available: [Calculator Name]

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.PipeFittingAndAccessoryPressureDropCalculatorNotAvailable
Pipe Fitting/Accessory Pressure Drop Calculator Not Available: [Calculator Name]

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.PipeConnectorsAreNotLined
A calculation did not complete because the connectors used by this family to connect to the network are not linked.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_OverConstrained
The calculation could not be executed as configured. The Pressure and Flow Rate combined constraint requires at least 2 other pressure or flow constraints. Specify additional constraints.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotFullyConnected
The network is not well connected. Some elements may have unexpected flow and pressure loss values.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotEnoughNodes
The calculation could not be executed as configured. Specify at least 4 elements before analyzing this network.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotEnoughElements
The calculation could not be executed as configured. Specify at least 3 elements before analyzing this network.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NodePropertyNotSet
The calculation could not be executed as configured. Specify a constraint property set for the following input or output node(s).

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NoPressureConstraint
The calculation could not be executed as configured. Each network requires at least 1 pressure constraint. Specify the pressure constraint.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NoOutputNode
The calculation could not be executed as configured. Select an output node before analyzing this network.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NoInputNode
The calculation could not be executed as configured. Select an input node before analyzing this network.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_ElementNodeIsNotPartOfNetwork
The calculation could not be executed as configured. At least one of the elements in this network uses a node that is not part of the network.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkUnderConstrained
The network is under constrained. You may specify the design flow value in the missing branches, or cap the open ends.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkPressureNotConverge
The calculation could not be performed. Verify the pressure on the input element.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkMinorLossNotConverge
The minor loss calculation could not be performed.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkInconsistentDemandFlow
The specified flow on this equipment is inconsistent with the other equipment in this branch. The branch flow is calculated based on the maximum specified value.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkExtraPumpOutsideSet
Flow calculations do not calculate this pump together with the other pumps as one equipment set. Verify the flow distribution and add the pump to the equipment set, if desired.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorOverConstrained
The calculation could not be performed due to overconstrained flow condition in the network.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorModelTooBig
The size of the network exceeds the current limit for flow/pressure analysis. In the Mechanical Settings dialog, under Pipe Settings - Calculation, disable the option to Use analysis for closed loop hydronic networks.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorExtractCurveData
The calculation could not be performed. Verify the pump curve data.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorElementWithDownUpStreamNode
The network needs an input or output element to perform the calculation.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorCalculatingPressure
The pressure calculation could not be performed.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkEnergyEquationNotConverge
The energy calculation could not be performed.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkDefaultToReynolds
The network uses the default Reynolds number.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkDefaultToPressure
The network uses the default pressure.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkCanNotDeterminCriticalPath
The calculation has completed, but there may be an error in determining the critical path. Verify that demand flow is specified for all required elements.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.MechanicalEquipmentSetBeingDeleted
The mechanical equipment set was deleted because it no longer contained any members.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.LoopSeparationNotCompleted
The loop separation is not completed yet. Only one side of the secondary/tertiary loop is separated. In order to correctly calculate the flow and pressure loss, please check and separate the other end of the loop.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.InvalidNumberOfMechanicalEquipmentOnDuty
The number of on duty equipment must be less than or equal to the number of available equipments.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.HydraulicSeparationOfOneSystem
Unable to hydraulically separate the loop when both supply and return are assigned to the same system. Try again with both start and end selected.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.HydraulicSeparationAmbiguity
Unable to hydraulically separate until the system has flow.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.FlowAndPressureCalculationMethodHasBeenImproved
During upgrade pressure drop calculations for hydronic piping systems using Simplified Colebrook or Custom Calculation methods have been recalculated using the Colebrook equation.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.ExtraPumpSet
More than one parallel pump set defined for the same loop. Verify the flow distribution and delete the extra set, if desired.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.DuctPressureDropCalculatorNotAvailable
Duct Pressure Drop Calculator Not Available: [Calculator Name]

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.DuctFittingAndAccessoryPressureDropCalculatorNotAvailable
Duct Fitting/Accessory Pressure Drop Calculator Not Available: [Calculator Name]

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.DemandFlowNotSetInLossFamily
A calculation did not complete because the Demand Flow for the element is not set.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.DemandFlowAndPressureLossNotSetInLossFamily
A calculation did not complete because the pressure loss value for element is not set. Select the element and enter a value for the Pressure Loss.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.ClassificationNotSetInFamily
A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.AtLeastOneEquipmentOnDuty
There should be at least one equipment on duty.

Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures
Failures about Fluid.